In [53]:
#creating a dataframe using numpy array:
import numpy as np
import pandas as pd

array=np.array([[5000,6000],["john","james"]])
df = pd.DataFrame({"Name":array[1],"Salary":array[0]})

df

    Name Salary
0   john   5000
1  james   6000

In [7]:
df = pd.DataFrame(np.random.randint(0,10,(3,3)),columns = ['x1','x2','x3'])

In [ ]:
import pandas as pd
import numpy as np

In [9]:
df

   x1  x2  x3
0   3   9   5
1   5   2   0
2   8   6   3

In [ ]:
#concatenation in pandas

In [15]:
#ex:1 
import pandas as pd

df1 = pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']

})
print(df1)

df2 = pd.DataFrame({
    'A':['A3','A4','A5'],
    'B':['B3','B1','B2']

})
print(df2)
result = pd.concat([df1,df2])
print(result)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
    A   B
0  A3  B3
1  A4  B1
2  A5  B2
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B1
2  A5  B2

In [17]:
#ex :2 :Concatenation Along columns (axis=1)
result = pd.concat([df1,df2], axis=1)

print(result)

    A   B   A   B
0  A0  B0  A3  B3
1  A1  B1  A4  B1
2  A2  B2  A5  B2

In [19]:
import pandas as pd
#create two dataframes
result = pd.concat([df1,df2], ignore_index = True)
print(result)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B1
5  A5  B2

In [21]:
#1.inner merge:

df1 =pd.DataFrame({
    'key':['A','B','C','D'],
    'value':[1,2,3,4]
})
print(df1)
df2 = pd.DataFrame({
    'key':['B','D','E','F'],
    'value':[5,6,7,8]
})

print(df2)

result = pd.merge(df1,df2, on='key',how = 'inner')  #here we will always focus on keys not values bcoz values is changed
print(result)

  key  value
0   A      1
1   B      2
2   C      3
3   D      4
  key  value
0   B      5
1   D      6
2   E      7
3   F      8
  key  value_x  value_y
0   B        2        5
1   D        4        6

In [23]:
#right merge
result = pd.merge(df1,df2, on='key',how = 'right')  #here we will always focus on keys not values bcoz values is changed
print(result)

  key  value_x  value_y
0   B      2.0        5
1   D      4.0        6
2   E      NaN        7
3   F      NaN        8

In [25]:
#3.left merge
result = pd.merge(df1,df2, on='key',how = 'left')  #here we will always focus on keys not values bcoz values is changed
print(result)

  key  value_x  value_y
0   A        1      NaN
1   B        2      5.0
2   C        3      NaN
3   D        4      6.0

In [27]:
#4.outer merge 
result = pd.merge(df1,df2, on='key',how = 'outer')  #here we will always focus on keys not values bcoz values is changed
print(result)

  key  value_x  value_y
0   A      1.0      NaN
1   B      2.0      5.0
2   C      3.0      NaN
3   D      4.0      6.0
4   E      NaN      7.0
5   F      NaN      8.0

In [59]:
import pandas as pd 

file_path = "D:/Documents/Documents/Besant technology/5.python/code/mtcars2.csv"

cars = pd.read_csv(file_path)
print(cars)

             Unnamed: 0   mpg  cyl   disp   hp  drat     wt   qsec  vs  am  \
0             Mazda RX4  21.0    6  160.0  110  3.90  2.620  16.46   0   1
1         Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875  17.02   0   1
2            Datsun 710  22.8    4  108.0   93  3.85  2.320  18.61   1   1
3        Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215  19.44   1   0
4           Merc 450SLC  15.2    8  275.8  180  3.07  3.780  18.00   0   0
5     Hornet Sportabout  18.7    8  360.0  175  3.15  3.440  17.02   0   0
6               Valiant  18.1    6  225.0  105  2.76  3.460  17.02   1   0
7            Duster 360  14.3    8  360.0  245  3.21  3.570  15.84   0   0
8             Merc 240D  24.4    4  146.7   62  3.69  3.190  20.00   1   0
9              Merc 230  22.8    4  140.8   95  3.92  3.150  22.90   1   0
10             Merc 280  19.2    6  167.6  123  3.92  3.440  18.30   1   0
11            Merc 280C  17.8    6  167.6  123  3.92  3.440  18.90   1   0
12           Merc 450SE  16.4    8  275.8  180  3.07  4.070  17.40   0   0
13   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0
14           Merc 450SL  17.3    8  275.8  180  3.07  3.730  17.60   0   0
15          Merc 450SLC  15.2    8  275.8  180  3.07  3.780  18.00   0   0
16          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0
17   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0
18  Lincoln Continental  10.4    8  460.0  215  3.00  5.424  17.82   0   0
19    Chrysler Imperial  14.7    8  440.0  230  3.23  5.345  17.42   0   0
20             Fiat 128  32.4    4   78.7   66  4.08  2.200  17.42   1   1
21          Honda Civic  30.4    4   75.7   52  4.93  1.615  18.52   1   1
22       Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1
23        Toyota Corona  21.5    4  120.1   97  3.70  2.465  20.01   1   0
24          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0
25     Dodge Challenger  15.5    8  318.0  150  2.76  3.520  16.87   0   0
26          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0
27           Camaro Z28  13.3    8  350.0  245  3.73  3.840  15.41   0   0
28     Pontiac Firebird  19.2    8  400.0  175  3.08  3.845  17.05   0   0
29            Fiat X1-9  27.3    4   79.0   66  4.08  1.935  17.05   1   1
30        Porsche 914-2  26.0    4  120.3   91  4.43  2.140  16.70   0   1
31         Lotus Europa  30.4    4   95.1  113  3.77  1.513  16.90   1   1
32       Ford Pantera L  15.8    8  351.0  264  4.22  3.170  14.50   0   1
33         Ferrari Dino  19.7    6  145.0  175  3.62  2.770  15.50   0   1
34        Maserati Bora  15.0    8  301.0  335  3.54  3.570  14.60   0   1
35           Volvo 142E  21.4    4  121.0  109  4.11  2.780  18.60   1   1
36          AMC Javelin  15.2    8  304.0  150  3.15  3.435  17.30   0   0
37   Cadillac Fleetwood  10.4    8  472.0  205  2.93  5.250  17.98   0   0
38  Lincoln Continental  10.4    8  460.0  215  3.00  5.424  17.82   0   0
39    Chrysler Imperial  14.7    8  440.0  230  3.23  5.345  17.42   0   0
40             Fiat 128  32.4    4   78.7   66  4.08  2.200  17.42   1   1
41          Honda Civic  30.4    4   75.7   52  4.93  1.615  18.52   1   1
42       Toyota Corolla  33.9    4   71.1   65  4.22  1.835  19.90   1   1
43        Toyota Corona  21.5    4  120.1   97  3.70  2.465  20.01   1   0

    gear  carb
0      4     4
1      4     4
2      4     1
3      3     1
4      3     3
5      3     2
6      3     1
7      3     4
8      4     2
9      4     2
10     4     4
11     4     4
12     3     3
13     3     4
14     3     3
15     3     3
16     3     2
17     3     4
18     3     4
19     3     4
20     4     1
21     4     2
22     4     1
23     3     1
24     3     2
25     3     2
26     3     2
27     3     4
28     3     2
29     4     1
30     5     2
31     5     2
32     5     4
33     5     6
34     5     8
35     4     2
36     3     2
37     3     4
38     3     4
39     3     4
40     4     1
41     4     2
42     4     1
43     3     1